In [1]:
%pip install --upgrade ipython-sql sqlalchemy psycopg2-binary

Requirement already satisfied: ipython-sql in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (0.5.0)
Requirement already satisfied: sqlalchemy in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (2.0.38)
Requirement already satisfied: psycopg2-binary in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (2.9.10)
Requirement already satisfied: prettytable in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (3.14.0)
Requirement already satisfied: ipython in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (8.32.0)
Requirement already satisfied: sqlparse in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: colorama in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (5.2.0)
Requirement already satisfied: jedi>=0.16 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (3.0.50)
Requirement already satisfied: pygments>=2.4.0 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (2.19.1)
Requirement already satisfied: stack_data in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: wcwidth in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from stack_data->ipython->ipython-sql) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from stack_data->ipython->ipython-sql) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\home\appdata\local\programs\python\python312\lib\site-packages (from stack_data->ipython->ipython-sql) (0.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
from sqlalchemy import create_engine, text
import pandas as pd

In [3]:
# Загружаем CSV-файлы
customer_df = pd.read_csv(r"C:\Users\Home\Downloads\customer.csv", sep=';')  
transaction_df = pd.read_csv(r"C:\Users\Home\Downloads\transaction.csv", sep=';')  # Укажи путь к файлу

# Проверяем данные
display(customer_df.head(), transaction_df.head())

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"
2,3,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82"
3,4,88,3135,31.08.2017,False,Approved,Norco Bicycles,Standard,medium,medium,"1198,46","381,10"
4,5,78,787,01.10.2017,True,Approved,Giant Bicycles,Standard,medium,large,"1765,3","709,48"

In [4]:
# Подключение к базе данных через SQLAlchemy
engine = create_engine("postgresql://postgres:2426@localhost:5432/postgres")

In [5]:
with engine.connect() as conn:
    conn.execute(text("DROP TABLE IF EXISTS transaction CASCADE;"))
    conn.execute(text("DROP TABLE IF EXISTS customer CASCADE;"))

    conn.execute(text("""
        CREATE TABLE customer (
            customer_id INT PRIMARY KEY,
            first_name VARCHAR(50),
            last_name VARCHAR(50),
            gender VARCHAR(30),
            dob VARCHAR(50),
            job_title VARCHAR(50),
            job_industry_category VARCHAR(50),
            wealth_segment VARCHAR(50),
            deceased_indicator VARCHAR(30),
            owns_car VARCHAR(30),
            address VARCHAR(50),
            postcode VARCHAR(30),
            country VARCHAR(30),
            property_valuation INT
        );
    """))

    conn.execute(text("""
        CREATE TABLE transaction (
            transaction_id INT PRIMARY KEY,
            product_id INT,
            customer_id INT REFERENCES customer(customer_id),
            transaction_date VARCHAR(30),
            online_order VARCHAR(30),
            order_status VARCHAR(30),
            brand VARCHAR(30),
            product_line VARCHAR(30),
            product_class VARCHAR(30),
            product_size VARCHAR(30),
            list_price FLOAT,
            standard_cost FLOAT
        );
    """))

    conn.commit()

print("✅ Таблицы успешно созданы!")

✅ Таблицы успешно созданы!

In [6]:
# Приведение колонок к нижнему регистру
customer_df.columns = customer_df.columns.str.lower()
transaction_df.columns = transaction_df.columns.str.lower()

#  Приведение цен к FLOAT (замена "," на ".")
transaction_df["standard_cost"] = (
    transaction_df["standard_cost"].astype(str).str.replace(",", ".").astype(float)
)
transaction_df["list_price"] = (
    transaction_df["list_price"].astype(str).str.replace(",", ".").astype(float)
)

# Удаляем таблицы с зависимостями перед созданием
with engine.connect() as conn:
    conn.execute(text("DROP TABLE IF EXISTS transaction CASCADE;"))  
    conn.execute(text("DROP TABLE IF EXISTS customer CASCADE;"))
    conn.commit()

# Проверяем, какие колонки есть в БД
existing_columns = pd.read_sql(
    "SELECT column_name FROM information_schema.columns WHERE table_name = 'customer'", 
    engine
)
existing_columns = existing_columns["column_name"].tolist()
print("Колонки в БД:", existing_columns)

# Если "state" нет в БД, но есть в DataFrame, удаляем перед загрузкой
if "state" not in existing_columns and "state" in customer_df.columns:
    print("Колонка 'state' отсутствует в БД, удаляем её из DataFrame.")
    customer_df = customer_df.drop(columns=["state"])

# Записываем данные в таблицы (сначала customer, затем transaction)
customer_df.to_sql("customer", engine, if_exists="replace", index=False)
transaction_df.to_sql("transaction", engine, if_exists="replace", index=False)

# Преобразуем standard_cost и list_price в FLOAT (если загружены как VARCHAR)
with engine.connect() as conn:
    conn.execute(text("""
        ALTER TABLE transaction 
        ALTER COLUMN standard_cost TYPE FLOAT USING standard_cost::FLOAT;
    """))
    conn.execute(text("""
        ALTER TABLE transaction 
        ALTER COLUMN list_price TYPE FLOAT USING list_price::FLOAT;
    """))
    conn.commit()

print("Данные успешно загружены и преобразованы в PostgreSQL!")

# Функция для выполнения SQL-запросов (новая версия)
def run_query(query):
    with engine.connect() as conn:
        result = conn.execute(text(query))
        if result.returns_rows:
            return pd.DataFrame(result.fetchall(), columns=result.keys())

Колонки в БД: []
Колонка 'state' отсутствует в БД, удаляем её из DataFrame.
Данные успешно загружены и преобразованы в PostgreSQL!

1. Вывести все уникальные бренды, у которых стандартная стоимость выше 1500

In [7]:
query = """
SELECT DISTINCT brand
FROM transaction
WHERE standard_cost > 1500;
"""

df = run_query(query)
display(df)

            brand
0           Solex
1  Giant Bicycles
2      OHM Cycles
3   Trek Bicycles

2. Найти среднюю стоимость (list_price) по каждому бренду

In [8]:
query = """
SELECT brand, AVG(list_price) AS avg_list_price
FROM transaction
GROUP BY brand
ORDER BY avg_list_price DESC;
"""

df = run_query(query)
display(df)

            brand  avg_list_price
0        WeareA2B     1263.454813
1  Giant Bicycles     1235.407204
2   Trek Bicycles     1183.783398
3            None     1090.899695
4           Solex     1057.271956
5      OHM Cycles      983.706983
6  Norco Bicycles      913.202450

3. Найти топ-5 клиентов, совершивших наибольшее количество покупок

In [9]:
query = """
SELECT customer_id, COUNT(transaction_id) AS total_purchases
FROM transaction
GROUP BY customer_id
ORDER BY total_purchases DESC
LIMIT 5;
"""

df = run_query(query)
display(df)

   customer_id  total_purchases
0         2183               14
1         1068               14
2         2476               14
3         1913               13
4         1129               13

4. Найти клиентов, у которых больше 5 покупок и средняя цена покупки выше 1000

In [10]:
query = """
SELECT customer_id, COUNT(transaction_id) AS total_purchases, AVG(list_price) AS avg_price
FROM transaction
GROUP BY customer_id
HAVING COUNT(transaction_id) > 5 AND AVG(list_price) > 1000
ORDER BY total_purchases DESC;
"""

df = run_query(query)
display(df)

      customer_id  total_purchases    avg_price
0            1068               14  1018.182143
1            2476               14  1041.335000
2            2183               14  1362.237143
3            3048               13  1135.083846
4            1140               13  1246.095385
...           ...              ...          ...
1205         1736                6  1454.310000
1206         3017                6  1098.050000
1207          508                6  1274.700000
1208         2627                6  1553.636667
1209         2712                6  1161.170000

[1210 rows x 3 columns]

5. Найти количество покупок в каждом месяце

In [11]:
query = """
SELECT 
    TO_CHAR(TO_DATE(transaction_date, 'DD.MM.YYYY'), 'YYYY-MM') AS month, 
    COUNT(transaction_id) AS total_purchases
FROM transaction
GROUP BY month
ORDER BY month;
"""

df = run_query(query)
display(df)

      month  total_purchases
0   2017-01             1682
1   2017-02             1623
2   2017-03             1656
3   2017-04             1655
4   2017-05             1685
5   2017-06             1581
6   2017-07             1717
7   2017-08             1749
8   2017-09             1572
9   2017-10             1771
10  2017-11             1665
11  2017-12             1644

6. Вывести список клиентов с их профессией и количеством покупок

In [12]:
query = """
SELECT c.customer_id, c.first_name, c.last_name, c.job_title, COUNT(t.transaction_id) AS total_purchases
FROM customer c
LEFT JOIN transaction t ON c.customer_id = t.customer_id
GROUP BY c.customer_id, c.first_name, c.last_name, c.job_title
ORDER BY total_purchases DESC;
"""

df = run_query(query)
display(df)

,customer_id,first_name,last_name,job_title,total_purchases
0,2476,Hal,Braddon,Administrative Officer,14
1,1068,Frazer,Searston,None,14
2,2183,Jillie,Fyndon,Programmer Analyst IV,14
3,3048,Kenon,Messruther,Legal Assistant,13
4,1129,Hercule,None,VP Marketing,13
...,...,...,...,...,...
3995,3754,Emmy,MacGibbon,None,0
3996,3713,Cynthy,Snoad,None,0
3997,3659,Farra,Catto,VP Sales,0
3998,3802,Leila,Elcombe,Chief Design Engineer,0
3999,3723,Justine,Pirt,Accountant II,0

7. Найти 3 самых популярных бренда по количеству покупок

In [13]:
query = """
SELECT brand, COUNT(transaction_id) AS total_purchases
FROM transaction
GROUP BY brand
ORDER BY total_purchases DESC
LIMIT 3;
"""

df = run_query(query)
display(df)

            brand  total_purchases
0           Solex             4253
1  Giant Bicycles             3312
2        WeareA2B             3295

8. Найти среднюю стоимость (standard_cost) по каждой категории product_class

In [14]:
query = """
SELECT product_class, AVG(standard_cost) AS avg_standard_cost
FROM transaction
GROUP BY product_class
ORDER BY avg_standard_cost DESC;
"""

df = run_query(query)
display(df)

  product_class  avg_standard_cost
0          None                NaN
1          high         721.419124
2        medium         527.480850
3           low         521.191542

9. Вывести топ-5 клиентов с самыми дорогими покупками

In [15]:
query = """
SELECT customer_id, MAX(list_price) AS max_purchase_price
FROM transaction
GROUP BY customer_id
ORDER BY max_purchase_price DESC
LIMIT 5;
"""

df = run_query(query)
display(df)

   customer_id  max_purchase_price
0         2469             2091.47
1          173             2091.47
2          576             2091.47
3         1589             2091.47
4         2172             2091.47

10. Найти, в каком месяце было больше всего покупок

In [16]:
query = """
SELECT 
    TO_CHAR(TO_DATE(transaction_date, 'DD.MM.YYYY'), 'YYYY-MM') AS month, 
    COUNT(transaction_id) AS total_purchases
FROM transaction
GROUP BY month
ORDER BY total_purchases DESC
LIMIT 1;
"""

df = run_query(query)
display(df)

     month  total_purchases
0  2017-10             1771